In [2]:
pip install ucimlrepo

Requirement already satisfied: ucimlrepo in c:\users\sride\anaconda3\lib\site-packages (0.0.7)Note: you may need to restart the kernel to use updated packages.
Requirement already satisfied: certifi>=2020.12.5 in c:\users\sride\anaconda3\lib\site-packages (from ucimlrepo) (2024.8.30)
Requirement already satisfied: pandas>=1.0.0 in c:\users\sride\anaconda3\lib\site-packages (from ucimlrepo) (1.1.3)
Requirement already satisfied: python-dateutil>=2.7.3 in c:\users\sride\anaconda3\lib\site-packages (from pandas>=1.0.0->ucimlrepo) (2.8.1)
Requirement already satisfied: numpy>=1.15.4 in c:\users\sride\anaconda3\lib\site-packages (from pandas>=1.0.0->ucimlrepo) (1.24.4)
Requirement already satisfied: pytz>=2017.2 in c:\users\sride\anaconda3\lib\site-packages (from pandas>=1.0.0->ucimlrepo) (2020.1)
Requirement already satisfied: six>=1.5 in c:\users\sride\anaconda3\lib\site-packages (from python-dateutil>=2.7.3->pandas>=1.0.0->ucimlrepo) (1.15.0)

In [3]:
from ucimlrepo import fetch_ucirepo 
# fetch dataset 
adult = fetch_ucirepo(id=2) 
  
# data (as pandas dataframes) 
X = adult.data.features 
y = adult.data.targets

In [4]:
#concat two dataframes

import seaborn as sns
import pandas as pd

adult = pd.concat([X, y], axis=1)
adult.head()

,age,workclass,fnlwgt,education,education-num,marital-status,occupation,relationship,race,sex,capital-gain,capital-loss,hours-per-week,native-country,income
0,39,State-gov,77516,Bachelors,13,Never-married,Adm-clerical,Not-in-family,White,Male,2174,0,40,United-States,<=50K
1,50,Self-emp-not-inc,83311,Bachelors,13,Married-civ-spouse,Exec-managerial,Husband,White,Male,0,0,13,United-States,<=50K
2,38,Private,215646,HS-grad,9,Divorced,Handlers-cleaners,Not-in-family,White,Male,0,0,40,United-States,<=50K
3,53,Private,234721,11th,7,Married-civ-spouse,Handlers-cleaners,Husband,Black,Male,0,0,40,United-States,<=50K
4,28,Private,338409,Bachelors,13,Married-civ-spouse,Prof-specialty,Wife,Black,Female,0,0,40,Cuba,<=50K

In [5]:
adult.isnull().sum()

age                 0
workclass         963
fnlwgt              0
education           0
education-num       0
marital-status      0
occupation        966
relationship        0
race                0
sex                 0
capital-gain        0
capital-loss        0
hours-per-week      0
native-country    274
income              0
dtype: int64

In [6]:
# check for wrong values in dataset for occupation and workclass
filter_a=adult[(adult['occupation']=='?')  &
               (adult['workclass']=='?') ]
print(filter_a)

       age workclass  fnlwgt     education  education-num  \
27      54         ?  180211  Some-college             10
61      32         ?  293936       7th-8th              4
69      25         ?  200681  Some-college             10
77      67         ?  212759          10th              6
106     17         ?  304873          10th              6
...    ...       ...     ...           ...            ...
32530   35         ?  320084     Bachelors             13
32531   30         ?   33811     Bachelors             13
32539   71         ?  287372     Doctorate             16
32541   41         ?  202822       HS-grad              9
32542   72         ?  129912       HS-grad              9

              marital-status occupation   relationship                race  \
27        Married-civ-spouse          ?        Husband  Asian-Pac-Islander
61     Married-spouse-absent          ?  Not-in-family               White
69             Never-married          ?      Own-child               White
77        Married-civ-spouse          ?        Husband               White
106            Never-married          ?      Own-child               White
...                      ...        ...            ...                 ...
32530     Married-civ-spouse          ?           Wife               White
32531          Never-married          ?  Not-in-family  Asian-Pac-Islander
32539     Married-civ-spouse          ?        Husband               White
32541              Separated          ?  Not-in-family               Black
32542     Married-civ-spouse          ?        Husband               White

          sex  capital-gain  capital-loss  hours-per-week native-country  \
27       Male             0             0              60          South
61       Male             0             0              40              ?
69       Male             0             0              40  United-States
77       Male             0             0               2  United-States
106    Female         34095             0              32  United-States
...       ...           ...           ...             ...            ...
32530  Female             0             0              55  United-States
32531  Female             0             0              99  United-States
32539    Male             0             0              10  United-States
32541  Female             0             0              32  United-States
32542    Male             0             0              25  United-States

      income
27      >50K
61     <=50K
69     <=50K
77     <=50K
106    <=50K
...      ...
32530   >50K
32531  <=50K
32539   >50K
32541  <=50K
32542  <=50K

[1836 rows x 15 columns]

In [7]:
#checking for null values
(adult=='?').sum()

age                  0
workclass         1836
fnlwgt               0
education            0
education-num        0
marital-status       0
occupation        1843
relationship         0
race                 0
sex                  0
capital-gain         0
capital-loss         0
hours-per-week       0
native-country     583
income               0
dtype: int64

In [8]:
# Replace incorrect values '?' with NA

adult['occupation']=adult['occupation'].replace('?', pd.NA)
adult['native-country']=adult['native-country'].replace('?', pd.NA)
adult['workclass']=adult['workclass'].replace('?', pd.NA)

In [9]:
#checking if the values are replaced
(adult=='?').sum()

age               0
workclass         0
fnlwgt            0
education         0
education-num     0
marital-status    0
occupation        0
relationship      0
race              0
sex               0
capital-gain      0
capital-loss      0
hours-per-week    0
native-country    0
income            0
dtype: int64

In [10]:
adult.isnull().sum()

age                  0
workclass         2799
fnlwgt               0
education            0
education-num        0
marital-status       0
occupation        2809
relationship         0
race                 0
sex                  0
capital-gain         0
capital-loss         0
hours-per-week       0
native-country     857
income               0
dtype: int64

In [11]:
# Replace null with mode in occupation column
adult['occupation'].fillna(value=adult['occupation'].mode()[0], inplace=True)

In [12]:
print(adult[adult['occupation']=='Prof-specialty'])

       age  workclass  fnlwgt     education  education-num  \
4       28    Private  338409     Bachelors             13
8       31    Private   45781       Masters             14
11      30  State-gov  141297     Bachelors             13
20      40    Private  193524     Doctorate             16
27      54       <NA>  180211  Some-college             10
...    ...        ...     ...           ...            ...
48829   58    Private  292710    Assoc-acdm             12
48836   33    Private  245211     Bachelors             13
48837   39    Private  215419     Bachelors             13
48838   64        NaN  321403       HS-grad              9
48839   38    Private  374983     Bachelors             13

           marital-status      occupation    relationship                race  \
4      Married-civ-spouse  Prof-specialty            Wife               Black
8           Never-married  Prof-specialty   Not-in-family               White
11     Married-civ-spouse  Prof-specialty         Husband  Asian-Pac-Islander
20     Married-civ-spouse  Prof-specialty         Husband               White
27     Married-civ-spouse  Prof-specialty         Husband  Asian-Pac-Islander
...                   ...             ...             ...                 ...
48829            Divorced  Prof-specialty   Not-in-family               White
48836       Never-married  Prof-specialty       Own-child               White
48837            Divorced  Prof-specialty   Not-in-family               White
48838             Widowed  Prof-specialty  Other-relative               Black
48839  Married-civ-spouse  Prof-specialty         Husband               White

          sex  capital-gain  capital-loss  hours-per-week native-country  \
4      Female             0             0              40           Cuba
8      Female         14084             0              50  United-States
11       Male             0             0              40          India
20       Male             0             0              60  United-States
27       Male             0             0              60          South
...       ...           ...           ...             ...            ...
48829    Male             0             0              36  United-States
48836    Male             0             0              40  United-States
48837  Female             0             0              36  United-States
48838    Male             0             0              40  United-States
48839    Male             0             0              50  United-States

       income
4       <=50K
8        >50K
11       >50K
20       >50K
27       >50K
...       ...
48829  <=50K.
48836  <=50K.
48837  <=50K.
48838  <=50K.
48839  <=50K.

[8981 rows x 15 columns]

In [13]:
adult.isnull().sum()

age                  0
workclass         2799
fnlwgt               0
education            0
education-num        0
marital-status       0
occupation           0
relationship         0
race                 0
sex                  0
capital-gain         0
capital-loss         0
hours-per-week       0
native-country     857
income               0
dtype: int64

In [14]:
#replace null with mode values for workclass and native country
adult['workclass'].fillna(value=adult['workclass'].mode()[0], inplace=True)
adult['native-country'].fillna(value=adult['native-country'].mode()[0], inplace=True)
adult.isnull().sum()

age               0
workclass         0
fnlwgt            0
education         0
education-num     0
marital-status    0
occupation        0
relationship      0
race              0
sex               0
capital-gain      0
capital-loss      0
hours-per-week    0
native-country    0
income            0
dtype: int64

In [21]:
#Encoding race using label encoding
from sklearn.preprocessing import LabelEncoder
le = LabelEncoder()
adult_encode=adult.copy()
adult_copy.head()
# Fit and transform the 'color' column
adult_encode['race_encoded'] = le.fit_transform(adult_encode['race'])

In [22]:
#encoding workclass using label encoding
adult_encode['workclass_encoded']=le.fit_transform(adult_encode['workclass'])

In [34]:
adult_encode['workclass_encoded'].unique()

array([6, 5, 3, 0, 1, 4, 7, 2])

In [44]:
print(adult_encode[adult_encode['workclass_encoded']==8][['workclass','workclass_encoded']])

Empty DataFrame
Columns: [workclass, workclass_encoded]
Index: []

In [33]:
# creating a dictionary with race values and their code values
race_codes={0:'Amer-Indian-Eskimo',1:'Asian-Pac-Islander', 2:'Black',3:'Other',4:'White'}

In [45]:
# creating a dictionary with workclass values and their code values
workclass_codes={0:'Federal-gov',1:'Local-gov',2:'Never-worked',3:'Private',4:'Self-emp-inc',5:'Self-emp-not-inc',6:'State-gov',7:'Without-pay'}

In [46]:
#using one hot encoding for sex
adult_encode=pd.get_dummies(adult_encode, columns = ['sex'])

In [47]:
adult_encode.head()

,age,workclass,fnlwgt,education,education-num,marital-status,occupation,relationship,race,capital-gain,capital-loss,hours-per-week,native-country,income,race_encoded,workclass_encoded,sex_Female,sex_Male
0,39,State-gov,77516,Bachelors,13,Never-married,Adm-clerical,Not-in-family,White,2174,0,40,United-States,<=50K,4,6,0,1
1,50,Self-emp-not-inc,83311,Bachelors,13,Married-civ-spouse,Exec-managerial,Husband,White,0,0,13,United-States,<=50K,4,5,0,1
2,38,Private,215646,HS-grad,9,Divorced,Handlers-cleaners,Not-in-family,White,0,0,40,United-States,<=50K,4,3,0,1
3,53,Private,234721,11th,7,Married-civ-spouse,Handlers-cleaners,Husband,Black,0,0,40,United-States,<=50K,2,3,0,1
4,28,Private,338409,Bachelors,13,Married-civ-spouse,Prof-specialty,Wife,Black,0,0,40,Cuba,<=50K,2,3,1,0

In [49]:
adult_encode['education'].unique()

array(['Bachelors', 'HS-grad', '11th', 'Masters', '9th', 'Some-college',
       'Assoc-acdm', 'Assoc-voc', '7th-8th', 'Doctorate', 'Prof-school',
       '5th-6th', '10th', '1st-4th', 'Preschool', '12th'], dtype=object)

In [50]:
#encoding education
adult_education_group=adult_encode.copy()
def replace_values(x):
    if x == '11th' or x == '10th' or x == '12th' or x == '9th' or x=='HS-grad' :
        return 'High-school'
    elif x == '1st-4th'  or x=='Preschool':
        return 'Elementary'
    elif x == '7th-8th' or  x == '5th-6th':
        return 'Middle-school'
    elif x=='Bachelors' or x=='Some-college':
        return 'Bachelors'
    else:
        return x
adult_education_group['education'] = adult_education_group['education'].apply(replace_values)
print("After Replacing:\n", adult_education_group['education'].unique())

After Replacing:
 ['Bachelors' 'High-school' 'Masters' 'Assoc-acdm' 'Assoc-voc'
 'Middle-school' 'Doctorate' 'Prof-school' 'Elementary']

In [68]:
education_mapper = {"Elementary":1, "Middle-school":2, "High-school":3,"Assoc-acdm":5,"Assoc-voc":4,"Prof-school":8,"Bachelors":6,"Masters":7,"Doctorate":9}

In [69]:
adult_education_group["education-encode"] = adult_education_group["education"].replace(education_mapper)

In [99]:
adult_education_group.head()

,age,workclass,fnlwgt,education,education-num,marital-status,occupation,relationship,race,capital-gain,capital-loss,hours-per-week,native-country,income,race_encoded,workclass_encoded,sex_Female,sex_Male,education-encode,occupation_encoded
0,39,State-gov,77516,Bachelors,13,Never-married,Adm-clerical,Not-in-family,White,2174,0,40,United-States,<=50K,4,6,0,1,6,0
1,50,Self-emp-not-inc,83311,Bachelors,13,Married-civ-spouse,Exec-managerial,Husband,White,0,0,13,United-States,<=50K,4,5,0,1,6,3
2,38,Private,215646,High-school,9,Divorced,Handlers-cleaners,Not-in-family,White,0,0,40,United-States,<=50K,4,3,0,1,3,5
3,53,Private,234721,High-school,7,Married-civ-spouse,Handlers-cleaners,Husband,Black,0,0,40,United-States,<=50K,2,3,0,1,3,5
4,28,Private,338409,Bachelors,13,Married-civ-spouse,Prof-specialty,Wife,Black,0,0,40,Cuba,<=50K,2,3,1,0,6,9

In [63]:
adult[adult['education']=='Doctorate'][['education','education-num']]

       education  education-num
20     Doctorate             16
63     Doctorate             16
89     Doctorate             16
96     Doctorate             16
189    Doctorate             16
...          ...            ...
48194  Doctorate             16
48394  Doctorate             16
48589  Doctorate             16
48644  Doctorate             16
48735  Doctorate             16

[594 rows x 2 columns]

In [66]:
adult['occupation'].unique()

array(['Adm-clerical', 'Exec-managerial', 'Handlers-cleaners',
       'Prof-specialty', 'Other-service', 'Sales', 'Craft-repair',
       'Transport-moving', 'Farming-fishing', 'Machine-op-inspct',
       'Tech-support', 'Protective-serv', 'Armed-Forces',
       'Priv-house-serv'], dtype=object)

In [70]:
#Encoding occupation
adult_education_group['occupation_encoded']=le.fit_transform(adult_education_group['occupation'])

In [71]:
adult_education_group['occupation_encoded'].unique()

array([ 0,  3,  5,  9,  7, 11,  2, 13,  4,  6, 12, 10,  1,  8])

In [86]:
print(adult_education_group[adult_education_group['occupation_encoded']==14][['occupation','occupation_encoded']])

Empty DataFrame
Columns: [occupation, occupation_encoded]
Index: []

In [87]:
#occupation codes
workclass_codes={0:'Adm-clerical',1:'Armed-Forces',2:'Craft-repair',3:'Exec-managerial',4:'Farming-fishing',5:'Handlers-cleaners',6:'Machine-op-inspct',7:'Other-service',8:'Priv-house-serv',9:'Prof-specialty',10:'Protective-serv',11:'Sales',12:'Tech-support',13:'Transport-moving'}

# Handling outliers

In [88]:
#IQR method to handle outliers in hours-per-week

percentile25 = adult['hours-per-week'].quantile(0.25)
percentile75 = adult['hours-per-week'].quantile(0.75)
print(percentile25, percentile75 )

40.0 45.0

In [89]:
#Finding iqr value
iqr=percentile75-percentile25
upper_limit = percentile75 + 1.5 * iqr
lower_limit = percentile25 - 1.5 * iqr
x=adult[(adult['hours-per-week']<lower_limit) | (adult['hours-per-week']>upper_limit)]
x[['hours-per-week','income','age']]

       hours-per-week  income  age
1                  13   <=50K   50
6                  16   <=50K   49
10                 80    >50K   37
12                 30   <=50K   23
20                 60    >50K   40
...               ...     ...  ...
48820               8  <=50K.   66
48822              55   >50K.   40
48825              32  <=50K.   64
48827              32  <=50K.   55
48841              60   >50K.   35

[13496 rows x 3 columns]

In [100]:
print(upper_limit,lower_limit)

52.5 32.5

In [94]:
# replacing hours-per-week outliers with upper and lower bounds
adult_outliers=adult_education_group.copy()

In [96]:
def replace_values(x):
    if x < lower_limit  :
        return lower_limit
    elif x > upper_limit:
        return upper_limit
    else:
        return x
adult_outliers['hours-per-week'] = adult_outliers['hours-per-week'].apply(replace_values)

In [97]:
#outliers in age

per25_age=adult['age'].quantile(0.25)
per75_age=adult['age'].quantile(0.75)

iqr=per75_age-per25_age
lbound_age=per25_age-1.5*iqr
ubound_age=per75_age+1.5*iqr
print(lbound_age, ubound_age)

-2.0 78.0